tests/load/register.yml
config:
  target: "{{ $processEnvironment.BASE_URL }}"
  phases:
    - duration: 30
      arrivalRate: 5
      name: ramp-up
    - duration: 60
      arrivalRate: 10
      name: sustained
    - duration: 30
      arrivalRate: 20
      name: stress
  defaults:
    headers:
      User-Agent: bangguy-loadtest
      X-Load-Test: "true"
  processor: "./processor.js"
  plugins:
    expect: {}
  http:
    timeout: 30

scenarios:
  - name: attend-register
    flow:
      - function: setupRegisterRequest
      - post:
          url: "/api/attend/register"
          multipart:
            - name: "employeeId"
              value: "{{ employeeId }}"
            - name: "name"
              value: "{{ employeeName }}"
            - name: "deviceId"
              value: "{{ deviceId }}"
            - name: "photo"
              file: "{{ photoPath }}"
              filename: "loadtest-photo.jpg"
              contentType: "image/jpeg"
          capture:
            - json: "$.ok"
              as: "responseOk"
            - json: "$.reason"
              as: "errorReason"
            - json: "$.error"
              as: "errorCode"
            - json: "$.message"
              as: "errorMessage"
          expect:
            - statusCode: [200, 400]  # 200 또는 400 모두 허용 (서버가 ok: false일 때도 200 반환)
            - contentType: json
      - log: "Request - employeeId: {{ employeeId }}, deviceId: {{ deviceId }}"
      - log: "Response - ok: {{ responseOk }}, reason: {{ errorReason }}, error: {{ errorCode }}, message: {{ errorMessage }}"
      - think: 1