tests/load/register.yml
config:
  target: "{{ $processEnvironment.BASE_URL }}"
  phases:
    - duration: 10
      arrivalRate: 80
      name: quick-test
  defaults:
    headers:
      User-Agent: bangguy-loadtest
      X-Load-Test: "true"
  processor: "./processor.js"
  plugins:
    expect: {}
  http:
    timeout: 30

scenarios:
  - name: attend-register
    flow:
      - function: setupRegisterRequest
      - function: sendRegisterRequest
      - log: "Request - employeeId: {{ employeeId }}, deviceId: {{ deviceId }}"
      - log: "Response - ok: {{ responseOk }}, reason: {{ errorReason }}, error: {{ errorCode }}, message: {{ errorMessage }}"
      - think: 1