tests/load/register.yml
config:
  target: "{{ $processEnvironment.BASE_URL }}"
  phases:
    - duration: 10
      arrivalRate: 2
      name: quick-test
  defaults:
    headers:
      User-Agent: bangguy-loadtest
      X-Load-Test: "true"
  processor: "./processor.js"
  plugins:
    expect: {}
  http:
    timeout: 30

scenarios:
  - name: attend-register
    flow:
      - function: setupRegisterRequest
      - post:
          url: "/api/attend/register"
          formData:
            employeeId: "{{ employeeId }}"
            name: "{{ employeeName }}"
            deviceId: "{{ deviceId }}"
            photo:
              value: "{{ photoPath }}"
              options:
                filename: "loadtest-photo.jpg"
                contentType: "image/jpeg"
      - log: "Request sent - employeeId: {{ employeeId }}, deviceId: {{ deviceId }}"
      - log: "Response status: {{ $statusCode }}"
      - log: "Response body: {{ $responseBody }}"
      - think: 1